results/oltp_read_only_8thr_2m/20230830-090431_eb0a698adcb94ece00c21a7689145b47956c0588_1.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 277.40 qps: 4529.24 (r/w/o: 3966.45/0.00/562.79) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 313.03 qps: 4995.46 (r/w/o: 4369.40/0.00/626.06) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 315.05 qps: 5026.76 (r/w/o: 4396.66/0.00/630.09) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 319.00 qps: 5125.94 (r/w/o: 4487.95/0.00/637.99) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 318.02 qps: 5080.31 (r/w/o: 4444.27/0.00/636.04) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 317.99 qps: 5105.78 (r/w/o: 4469.80/0.00/635.97) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 319.99 qps: 5117.78 (r/w/o: 4477.81/0.00/639.97) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 313.01 qps: 4982.16 (r/w/o: 4356.14/0.00/626.02) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 310.99 qps: 4979.85 (r/w/o: 4357.87/0.00/621.98) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 313.98 qps: 5033.66 (r/w/o: 4405.71/0.00/627.96) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 322.01 qps: 5138.16 (r/w/o: 4494.14/0.00/644.02) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 287.01 qps: 4587.08 (r/w/o: 4013.07/0.00/574.01) lat (ms,99%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 324.02 qps: 5195.38 (r/w/o: 4547.33/0.00/648.05) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 320.98 qps: 5129.64 (r/w/o: 4487.68/0.00/641.95) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 313.03 qps: 5002.40 (r/w/o: 4376.35/0.00/626.05) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 323.99 qps: 5178.78 (r/w/o: 4530.81/0.00/647.97) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 321.02 qps: 5152.33 (r/w/o: 4510.29/0.00/642.04) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 309.98 qps: 4960.75 (r/w/o: 4340.78/0.00/619.97) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 314.02 qps: 5008.38 (r/w/o: 4380.34/0.00/628.05) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 312.00 qps: 5010.93 (r/w/o: 4386.94/0.00/623.99) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 317.99 qps: 5110.77 (r/w/o: 4474.80/0.00/635.97) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 321.00 qps: 5118.00 (r/w/o: 4476.00/0.00/642.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 319.00 qps: 5096.01 (r/w/o: 4458.01/0.00/638.00) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 316.99 qps: 5061.88 (r/w/o: 4427.89/0.00/633.98) lat (ms,99%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 314.00 qps: 5056.99 (r/w/o: 4428.99/0.00/628.00) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 316.02 qps: 5038.26 (r/w/o: 4406.23/0.00/632.03) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 324.98 qps: 5194.74 (r/w/o: 4544.77/0.00/649.97) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 318.00 qps: 5104.93 (r/w/o: 4468.94/0.00/635.99) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 318.00 qps: 5073.03 (r/w/o: 4438.03/0.00/635.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 323.01 qps: 5179.16 (r/w/o: 4532.14/0.00/647.02) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 8 tps: 316.98 qps: 5050.67 (r/w/o: 4416.71/0.00/633.96) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 8 tps: 320.03 qps: 5129.51 (r/w/o: 4489.45/0.00/640.06) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 8 tps: 315.00 qps: 5058.93 (r/w/o: 4428.94/0.00/629.99) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 8 tps: 321.00 qps: 5122.99 (r/w/o: 4480.99/0.00/642.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 313.01 qps: 4991.18 (r/w/o: 4365.15/0.00/626.02) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 8 tps: 310.99 qps: 4965.87 (r/w/o: 4343.88/0.00/621.98) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 8 tps: 312.00 qps: 5011.95 (r/w/o: 4387.96/0.00/623.99) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 8 tps: 322.01 qps: 5163.09 (r/w/o: 4519.08/0.00/644.01) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 8 tps: 330.01 qps: 5265.08 (r/w/o: 4606.07/0.00/659.01) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 311.93 qps: 4994.89 (r/w/o: 4370.03/0.00/624.86) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 8 tps: 319.07 qps: 5114.16 (r/w/o: 4476.01/0.00/638.14) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 8 tps: 320.00 qps: 5126.00 (r/w/o: 4486.00/0.00/640.00) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 8 tps: 318.00 qps: 5078.92 (r/w/o: 4442.93/0.00/635.99) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 8 tps: 317.97 qps: 5069.48 (r/w/o: 4433.55/0.00/635.94) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 313.03 qps: 5006.42 (r/w/o: 4380.36/0.00/626.05) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 8 tps: 320.99 qps: 5167.83 (r/w/o: 4525.86/0.00/641.98) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 8 tps: 321.97 qps: 5150.49 (r/w/o: 4506.55/0.00/643.94) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 8 tps: 332.02 qps: 5310.36 (r/w/o: 4646.31/0.00/664.04) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 8 tps: 341.02 qps: 5454.30 (r/w/o: 4772.27/0.00/682.04) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 331.01 qps: 5287.11 (r/w/o: 4625.10/0.00/662.01) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 8 tps: 327.96 qps: 5235.34 (r/w/o: 4579.42/0.00/655.92) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 8 tps: 323.04 qps: 5169.64 (r/w/o: 4523.56/0.00/646.08) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 8 tps: 341.00 qps: 5464.00 (r/w/o: 4782.00/0.00/682.00) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 8 tps: 353.00 qps: 5646.96 (r/w/o: 4940.96/0.00/705.99) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 352.99 qps: 5656.88 (r/w/o: 4950.89/0.00/705.98) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 8 tps: 324.01 qps: 5192.13 (r/w/o: 4544.12/0.00/648.02) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 8 tps: 330.94 qps: 5286.11 (r/w/o: 4624.22/0.00/661.89) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 8 tps: 327.05 qps: 5229.84 (r/w/o: 4575.74/0.00/654.11) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 8 tps: 325.00 qps: 5202.03 (r/w/o: 4552.03/0.00/650.00) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 324.99 qps: 5179.77 (r/w/o: 4529.80/0.00/649.97) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 8 tps: 319.01 qps: 5110.14 (r/w/o: 4472.12/0.00/638.02) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 8 tps: 322.94 qps: 5191.03 (r/w/o: 4545.15/0.00/645.88) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 8 tps: 314.01 qps: 5001.09 (r/w/o: 4373.08/0.00/628.01) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 8 tps: 321.02 qps: 5128.33 (r/w/o: 4487.28/0.00/641.04) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 316.05 qps: 5087.73 (r/w/o: 4454.64/0.00/633.09) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 8 tps: 320.97 qps: 5122.52 (r/w/o: 4480.58/0.00/641.94) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 8 tps: 317.98 qps: 5087.64 (r/w/o: 4451.69/0.00/635.96) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 8 tps: 307.01 qps: 4929.19 (r/w/o: 4315.17/0.00/614.02) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 8 tps: 313.05 qps: 5001.87 (r/w/o: 4375.76/0.00/626.11) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 324.99 qps: 5194.76 (r/w/o: 4544.79/0.00/649.97) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 8 tps: 310.95 qps: 4956.22 (r/w/o: 4334.32/0.00/621.90) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 8 tps: 316.01 qps: 5073.21 (r/w/o: 4441.18/0.00/632.03) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 8 tps: 320.03 qps: 5115.49 (r/w/o: 4475.43/0.00/640.06) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 8 tps: 329.98 qps: 5277.61 (r/w/o: 4617.66/0.00/659.95) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 8 tps: 320.02 qps: 5119.30 (r/w/o: 4479.26/0.00/640.04) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 8 tps: 319.00 qps: 5119.98 (r/w/o: 4481.98/0.00/638.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 8 tps: 316.02 qps: 5050.31 (r/w/o: 4418.27/0.00/632.04) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 8 tps: 322.00 qps: 5154.98 (r/w/o: 4510.98/0.00/644.00) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 8 tps: 320.00 qps: 5132.99 (r/w/o: 4492.99/0.00/640.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 321.00 qps: 5100.99 (r/w/o: 4458.99/0.00/642.00) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 8 tps: 319.99 qps: 5134.78 (r/w/o: 4494.81/0.00/639.97) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 8 tps: 323.02 qps: 5182.27 (r/w/o: 4536.24/0.00/646.03) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 8 tps: 312.00 qps: 4989.94 (r/w/o: 4365.95/0.00/623.99) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 8 tps: 313.99 qps: 5004.76 (r/w/o: 4376.79/0.00/627.97) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 8 tps: 319.02 qps: 5104.28 (r/w/o: 4466.24/0.00/638.03) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 8 tps: 322.99 qps: 5182.90 (r/w/o: 4536.91/0.00/645.99) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 8 tps: 315.00 qps: 5036.96 (r/w/o: 4406.97/0.00/630.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 8 tps: 314.00 qps: 5034.01 (r/w/o: 4406.00/0.00/628.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 8 tps: 332.98 qps: 5299.67 (r/w/o: 4633.71/0.00/665.96) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 319.02 qps: 5094.39 (r/w/o: 4456.34/0.00/638.05) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 8 tps: 334.99 qps: 5399.86 (r/w/o: 4729.88/0.00/669.98) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 8 tps: 332.99 qps: 5269.89 (r/w/o: 4603.90/0.00/665.99) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 8 tps: 319.98 qps: 5150.64 (r/w/o: 4510.69/0.00/639.96) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 8 tps: 317.03 qps: 5102.47 (r/w/o: 4468.41/0.00/634.06) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 8 tps: 322.00 qps: 5136.95 (r/w/o: 4492.96/0.00/643.99) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 8 tps: 315.01 qps: 5018.14 (r/w/o: 4388.12/0.00/630.02) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 8 tps: 319.98 qps: 5124.73 (r/w/o: 4484.77/0.00/639.97) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 8 tps: 321.01 qps: 5167.22 (r/w/o: 4525.19/0.00/642.03) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 8 tps: 334.00 qps: 5312.97 (r/w/o: 4645.97/0.00/667.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 323.00 qps: 5189.00 (r/w/o: 4542.00/0.00/647.00) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 8 tps: 321.98 qps: 5150.64 (r/w/o: 4506.68/0.00/643.95) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 8 tps: 320.01 qps: 5111.12 (r/w/o: 4471.11/0.00/640.02) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 8 tps: 320.01 qps: 5134.23 (r/w/o: 4494.20/0.00/640.03) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 8 tps: 324.01 qps: 5172.12 (r/w/o: 4524.10/0.00/648.01) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 8 tps: 311.99 qps: 4978.82 (r/w/o: 4354.84/0.00/623.98) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 8 tps: 316.01 qps: 5062.16 (r/w/o: 4430.14/0.00/632.02) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 8 tps: 323.98 qps: 5172.76 (r/w/o: 4524.79/0.00/647.97) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 8 tps: 313.01 qps: 5033.22 (r/w/o: 4407.19/0.00/626.03) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 8 tps: 317.99 qps: 5057.90 (r/w/o: 4422.91/0.00/634.99) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 319.00 qps: 5130.03 (r/w/o: 4491.03/0.00/639.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 8 tps: 324.00 qps: 5197.94 (r/w/o: 4549.95/0.00/647.99) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 8 tps: 316.00 qps: 5009.95 (r/w/o: 4377.95/0.00/631.99) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 8 tps: 337.99 qps: 5431.90 (r/w/o: 4755.91/0.00/675.99) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 8 tps: 351.02 qps: 5625.30 (r/w/o: 4923.27/0.00/702.04) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 8 tps: 341.99 qps: 5456.86 (r/w/o: 4772.88/0.00/683.98) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 8 tps: 335.00 qps: 5354.98 (r/w/o: 4684.98/0.00/670.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 8 tps: 328.00 qps: 5258.06 (r/w/o: 4602.05/0.00/656.01) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 8 tps: 324.97 qps: 5213.50 (r/w/o: 4563.57/0.00/649.94) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 8 tps: 322.04 qps: 5128.61 (r/w/o: 4484.53/0.00/644.08) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 322.97 qps: 5151.51 (r/w/o: 4505.58/0.00/645.94) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      17.633 |                                         1
      17.954 |                                         1
      18.280 |                                         6
      18.612 |                                         15
      18.950 |                                         23
      19.295 |                                         40
      19.645 |*                                        89
      20.002 |**                                       143
      20.366 |***                                      251
      20.736 |****                                     384
      21.112 |*******                                  620
      21.496 |**********                               937
      21.886 |**************                           1325
      22.284 |********************                     1863
      22.689 |************************                 2252
      23.101 |*******************************          2897
      23.521 |************************************     3361
      23.948 |**************************************   3525
      24.384 |**************************************** 3751
      24.827 |***********************************      3280
      25.278 |********************************         3000
      25.737 |**************************               2468
      26.205 |*********************                    1929
      26.681 |**************                           1354
      27.165 |**********                               906
      27.659 |*******                                  648
      28.162 |****                                     412
      28.673 |***                                      275
      29.194 |**                                       225
      29.725 |**                                       213
      30.265 |**                                       186
      30.815 |**                                       154
      31.375 |*                                        128
      31.945 |*                                        121
      32.525 |*                                        100
      33.116 |*                                        116
      33.718 |*                                        118
      34.330 |*                                        118
      34.954 |*                                        133
      35.589 |**                                       155
      36.236 |**                                       170
      36.894 |**                                       159
      37.565 |*                                        140
      38.247 |*                                        130
      38.942 |*                                        93
      39.650 |*                                        72
      40.370 |*                                        56
      41.104 |                                         42
      41.851 |                                         19
      42.611 |                                         15
      43.385 |                                         10
      44.173 |                                         10
      44.976 |                                         11
      45.793 |                                         8
      46.625 |                                         3
      47.472 |                                         5
      48.335 |                                         8
      49.213 |                                         1
      50.107 |                                         1
      51.018 |                                         2
      51.945 |                                         1
      54.828 |                                         2
      55.824 |                                         2
      59.993 |                                         1
      62.193 |                                         1
      63.323 |                                         1
      64.474 |                                         2
      65.645 |                                         2
      66.838 |                                         1
      68.053 |                                         1
      70.548 |                                         2
      71.830 |                                         1
      75.817 |                                         1
      80.025 |                                         1
      82.959 |                                         1
 
SQL statistics:
    queries performed:
        read:                            538972
        write:                           0
        other:                           76996
        total:                           615968
    transactions:                        38498  (320.74 per sec.)
    queries:                             615968 (5131.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      320.7380
    time elapsed:                        120.0294s
    total number of events:              38498

Latency (ms):
         min:                                   17.79
         avg:                                   24.94
         max:                                   82.83
         99th percentile:                       38.25
         sum:                               960100.90

Threads fairness:
    events (avg/stddev):           4812.2500/8.61
    execution time (avg/stddev):   120.0126/0.01